# Використовуємо Node.js як базовий образ
FROM node:18 as build

# Встановлюємо робочий каталог у контейнері
WORKDIR /app

# Копіюємо package.json та package-lock.json до робочого каталогу
COPY package*.json ./

# Встановлюємо залежності
RUN npm install

# Копіюємо весь код додатку до контейнера
COPY . .

# Будуємо React додаток для продакшну
RUN npm run build

# Запускаємо продакшн сервер
FROM node:18

# Встановлюємо робочий каталог у контейнері
WORKDIR /app

# Копіюємо зібрану версію додатку
COPY --from=build /app/build ./build

# Встановлюємо сервер для обслуговування статичних файлів
RUN npm install -g serve

# Відкриваємо порт 3000 (або інший, на якому ви будете запускати додаток)
EXPOSE 3000

# Запускаємо додаток
CMD ["serve", "-s", "build", "-l", "3000"]
